hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v2/TAL_WITA_VERSION_MIGR_NEU/ENTM-PV.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
    xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v2" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>NEU</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallart>Bereitstellung</geschaeftsfallart>
            </order>
            <message>
                <ENTM-PV>
                    <meldungsattribute>
                        <vertragsnummer>${contractId}</vertragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                        <entgelttermin>${plannedAquisitionDate}</entgelttermin>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0010</meldungscode>
                            <meldungstext>Auftrag ausgeführt</meldungstext>
                        </position>
                    </meldungspositionen>
                </ENTM-PV>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
